Revit 2024 API
BuiltInFailures.BendFailures.BendAngleIsUnacceptable Property
 The angle of the bend/elbow is unacceptable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BendAngleIsUnacceptable { get; }
Visual Basic
Public Shared ReadOnly Property BendAngleIsUnacceptable As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BendAngleIsUnacceptable {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace